GetFamilyPointPlacementReferences Method
 Returns the Point Placement References for the Family Instance.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public IList<FamilyPointPlacementReference> GetFamilyPointPlacementReferences()
  Visual Basic
Public Function GetFamilyPointPlacementReferences As IList(Of FamilyPointPlacementReference)
  Visual C++
public:
IList<FamilyPointPlacementReference^>^ GetFamilyPointPlacementReferences()
 Remarks
 If a family instance has point placement references then they are returned by this method, otherwise an empty collection is returned. Examples of FamilyInstance objects that contain placement references are Panels and Flexible Components.
 See Also
  FamilyInstance Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →